{"name":"Alex Collado Garrido","title":"Gameplay Programmer","contacts":"Show Contacts","email":"EMAIL","email-text":"alex.collado@proton.me","phone":"PHONE","phone-text":"+34 669 189 957","birthday":"BIRTHDAY","birthday-text":"Feb 02, 2001","location":"LOCATION","location-text":"Castelldefels, Barcelona, Spain","resume":"Resume","portfolio":"Portfolio","about":"About me","about-text":"Multimedia Engineer with interest in video game development, especially in gameplay programming. I am always open to new experiences, I like to focus on the problem solving, and I want to dedicate myself to creating interactive experiences for everyone to enjoy.","education":"Education","education-salle":"La Salle (Universitat Ramon Llull)","education-salle-date":"2019 — 2024","education-text":"Bachelor's Degree in Multimedia Engineering","experience":"Experience","experience-itbid":"IT Developer Intern","experience-itbid-date":"itbid - Feb. 2024 — Jul. 2024","experience-itbid-text":"Worked maintaining and upgrading the itbid web platform and solving support tickets as full-stack developer intern.","hard-skills":"Hard Skills","hard-skills-1":"Game Engines","hard-skills-1-text":"Unity, Godot, Unreal Engine 4","hard-skills-2":"Programming","hard-skills-2-text":"C#, C++, C, GDScript","hard-skills-3":"3D Modelling","hard-skills-3-text":"Blender, 3DS Max, Substance Painter","portfolio-title":"Portfolio","portfolio-robo-date":"2024 - la Salle","portfolio-robo-title":"TFG - Robo Bobot","portfolio-robo-text":"Multiplayer action game developed in the Godot engine.","portfolio-barista-date":"2023 - la Salle","portfolio-barista-title":"Unity VR Game - Mad Barista","portfolio-barista-text":"Inmersive VR game in Unity about serving drinks.","portfolio-ikarus-date":"2022 - la Salle","portfolio-ikarus-title":"3D Unity game - Ikarus' Odyssey","portfolio-ikarus-text":"3D puzle game made in Unity.","back":"Go Back","robo-title":"Robo Bobot","robo-text-1":"Robo Bobot is a multiplayer mobile arcade action game where two players compete against each other in a ball game inspired by air hockey. The game features a single-player mode where you play against the machine or a multiplayer mode where two players can play together.","robo-text-2":"","ikarus-title":"Ikarus' Odyssey","ikarus-text-1":"Ikarus' Odyssey is a puzzle and adventure game based on the myth of Icarus, where you control the fallen angel in search of his wings. To find them, you must traverse six levels filled with puzzles and challenges.","ikarus-text-2":"I worked on programming all the character animations used in the game.","ikarus-text-3":"On the programming of all systems related to puzzles and their resolution.","ikarus-text-4":"I also worked on various shaders and graphical effects, such as water, lighting, and other visual effects.","ikarus-text-5":"And on different movement systems for the character, such as a dynamic climbing system.","ikarus-text-6":"This game was the final project for the Video Game Production course in 2023, and my role was Gameplay Programmer and Technical Artist, along with a significant part of the game design.","barista-title":"Mad Barista","barista-text-1":"Mad Barista is a VR game developed in Unity. In this game, you must serve customers by preparing the drinks they request. You'll have to mix the correct ingredients to make the requested cocktails!","barista-text-2":"This game was created as the final project for the Virtual Reality course in 2023, and my role in this game was as a Gameplay Programmer and Technical Artist. I programmed all the mechanics that allow you to serve drinks and mix ingredients. I also worked on the scene setup and the different shaders for the graphical effects seen in the game."}
