{"name":"Alex Collado Garrido","title":"Programador de Gameplay","contacts":"Mostrar Contactos","email":"CORREO","email-text":"alex.collado@proton.me","phone":"TELÉFONO","phone-text":"+34 669 189 957","birthday":"FECHA DE NACIMIENTO","birthday-text":"02 de febrero de 2001","location":"UBICACIÓN","location-text":"Castelldefels, Barcelona, España","resume":"Currículum","portfolio":"Portafolio","about":"Sobre mí","about-text":"Ingeniero Multimedia con interés en el desarrollo de videojuegos, especialmente en la programación de gameplay. Siempre estoy abierto a nuevas experiencias, me gusta enfocarme en la resolución de problemas y quiero dedicarme a crear experiencias interactivas para que todos las disfruten.","education":"Educación","education-salle":"La Salle (Universitat Ramon Llull)","education-salle-date":"2019 — 2024","education-text":"Grado en Ingeniería Multimedia","experience":"Experiencia","experience-itbid":"Prácticas como Desarrollador IT","experience-itbid-date":"itbid - Feb. 2024 — Jul. 2024","experience-itbid-text":"Trabajé manteniendo y mejorando la plataforma web de itbid y resolviendo tickets de soporte como desarrollador full-stack en prácticas.","hard-skills":"Habilidades Técnicas","hard-skills-1":"Motores de Juegos","hard-skills-1-text":"Unity, Godot, Unreal Engine 4","hard-skills-2":"Programación","hard-skills-2-text":"C#, C++, C, GDScript","hard-skills-3":"Modelado 3D","hard-skills-3-text":"Blender, 3DS Max, Substance Painter","portfolio-title":"Portafolio","portfolio-robo-date":"2024 - La Salle","portfolio-robo-title":"TFG - Robo Bobot","portfolio-robo-text":"Juego de acción multijugador desarrollado con el motor Godot.","portfolio-barista-date":"2023 - La Salle","portfolio-barista-title":"Juego VR en Unity - Mad Barista","portfolio-barista-text":"Juego inmersivo de realidad virtual en Unity sobre servir bebidas.","portfolio-ikarus-date":"2022 - La Salle","portfolio-ikarus-title":"Juego 3D en Unity - Ikarus' Odyssey","portfolio-ikarus-text":"Juego de puzles 3D desarrollado en Unity.","back":"Regresar","robo-title":"Robo Bobot","robo-text-1":"Robo Bobot es un juego móvil multijugador de acción árcade en el que dos personas compiten entre ellas en un juego de pelota inspirado por el air hockey.El juego tiene un modo para un jugador en el que se juega contra la maquina o un modo multijugador en el que pueden jugar dos personas.","robo-text-2":"","ikarus-title":"Ikarus' Odyssey","ikarus-text-1":"Ikarus' Odyssey es un juego de puzles y aventura basado en el mito de Ícaro, en el que controlamos al angel caido en busca de sus alas. Para encontrarlas dtendremos que atravesar 6 niveles llenos de puzles y desafios.","ikarus-text-2":"Trabaje programando todas las animaciones de personajes usadas en el juego.","ikarus-text-3":"En la programacion de todos los sistemas ligados a los puzles y a su resolucion.","ikarus-text-4":"Tambien trabaje en varios shaders y efectos graficos, como el agua o la iluminación y otros efectos graficos.","ikarus-text-5":"Y en diferentes sistemas de movimientos para el personaje, como un sistema de escalada dinamico.","ikarus-text-6":"Este juego fue el proyecto final de la asignatura de Producción de Videojuegos en 2023, y mi trabajo fue el programador de Gameplay y technical artist, junto con gran parte del diseño del juego.","barista-title":"Mad Barista","barista-text-1":"Mad Barista es un juego para VR desarrollado en Unity. En este juego tienes que atender a los clientes sirviendoles las bebidas que ellos te soliciten. Tendrás que mezclar los ingredientes correctos para preparar los cocteles solicitados!","barista-text-2":"Este juego se creo como el trabajo final de la asignatura de Realidad Virtual en 2023, y mi trabajo en este juego fue como programador del gameplay y technical artist. Programe todas las mecánicas que te permiten servir las copas y mezclar los ingredientes. También trabaje en el montaje de la escena y los diferentes shaders de los efectos gráficos que se ven en el juego."}
